/* Рудович Александра, 1 курс, пи, фск, лаб14
11)	Дана последовательность A=(ai), i=1..n, n<=100,  Продублировать все наибольшие  элементы.

*/


#include <iostream>

using namespace std;


int main()
{
    int a[100], b[200];
    int n, k = 0, i, M;

    do
    {
        cout << "input n<=100" << endl;
        cout << "n = ";
        cin >> n;
    }
    while ( n > 100);

    //генерируем массив(случайные значения или ввод с клавиатуры)
    for ( i = 0; i < n; i++)
    {
        a[i] = rand() % 100;
        cout << a[i] << "  ";
        //cin >> a[i];
    }

    cout << endl;

    //находим значение наибольших элементов массива
    M = a[0];
    for ( i = 0; i < n; i++ )
    {
        if ( a[i] >= M)
            M = a[i];
    }

    //дублируем их
    for ( i = 0; i < n; i++ )
    {
        if ( a[i] == M)
            b[k++] = a[i];
        b[k++] = a[i];
    }

    //вывод результата
    for ( i = 0; i < k; i++)
      cout << b[i] << "  ";

}
